import { v4 as uuidv4 } from 'uuid';

const arr = [
    {
        "title": "Календар, свідоцтво, презентація",
        "template": [
            {
                "title": "🗓 Колеги, додайте розклад підвищення кваліфікації з «На Урок» у ваш Google Calendar: https://calendar.google.com/calendar/u/0/r?cid=calendar@naurok.com.ua"
            },
            {
                "title": "🔔 Впроваджуйте у свою діяльність набір інноваційних інструментів на основі штучного інтелекту, який оптимізує щоденну роботу – «Персональний помічник вчителя»: https://naurok.com.ua/assistant"
            },
            {
                "title": "📃 Бажаєте отримати свідоцтво? На сторінці вебінару натисніть на зелену кнопку «Замовити свідоцтво»..."
            },
            {
                "title": "🔔 Щоб замовити свідоцтво, на сторінці вебінару натисніть на зелену кнопку «Замовити свідоцтво»..."
            },
            {
                "title": "📩 Друзі, щоб отримати оплачене свідоцтво, на сторінці вебінару після ефіру натисніть на зелену кнопку «Завантажити свідоцтво»"
            },
            {
                "title": "🔍 Колеги, слідкуйте за оновленнями на нашому сайті."
            },
            {
                "title": "💡 Присвятіть час роботі з дітьми, а штучний інтелект допоможе впоратися з рутиною. Користуйтеся Персональним помічником від НаУрок: https://naurok.com.ua/assistant"
            }
        ]
    },
    {
        "title": "На завершення",
        "template": [
            {
                "title": "🔔 Свідоцтво можна завантажити після ефіру на сторінці вебінару або у своєму кабінеті на сайті."
            },
            {
                "title": "⏰ Презентація та запис трансляції будуть після ефіру на сторінці вебінару"
            },
            {
                "title": "💬 Колеги, не забувайте: якщо у вас виникають запитання до лектора, обов'язково пишіть їх у чаті!"
            },
            {
                "title": "💬 Не забувайте: якщо у вас виникають запитання до лекторки, обов'язково пишіть їх у чаті! Ми передамо всі запитання лекторці!"
            },
            {
                "title": "📌 Шановні колеги, після ефіру ви зможете переглянути відеозапис вебінару та завантажити презентацію на сторінці події."
            },
            {
                "title": "🔔 Свідоцтво можна завантажити після ефіру на сторінці вебінару або у своєму кабінеті на сайті. Оновіть сторінку після завершення вебінару та успішно складіть тест."
            },
            {
                "title": "🔔 Дякуємо за увагу! Сподіваємося, що вебінар був корисним для всіх учасників. До зустрічі!"
            },
            {
                "title": "🔔 Дякуємо за увагу! Сподіваємося, що вебінар був корисним для всіх учасників. Слава Україні 💙💛"
            },
            {
                "title": "📌 Ви можете переглянути вебінар повторно та завантажити презентацію в будь-який зручний для Вас час, крім того, у Вас буде декілька спроб для успішного проходження тесту."
            },
            {
                "title": "💡На свідоцтві відображаються дані, вказані в ваших особистих кабінетах.Ви можете самостійно відредагувати дані (ПІБ, ЗО) в особистому кабінеті у розділі Налаштування https://naurok.com.ua/preferences"
            },
            {
                "title": "📍 Презентація та програма знаходяться на сторінці вебінару. Ви можете завантажити їх одразу після ефіру. Для завантаження цих матеріалів достатньо реєстрації на вебінар."
            },
            {
                "title": "💡 Відеозапис вебінару у безкоштовному доступі буде розміщений на сайті відразу після завершення прямої трансляції."
            },
            {
                "title": "❗️ Це посилання спрямує вас на сайт за межами YouTube. Ви можете обрати варіант 'Перейти на сайт'."
            }
        ]
    },
    {
        "title": "Інформаційний блок",
        "template": [
            {
                "title": "🔔 Добрий день, шановні учасники вебінару! Трансляція почнеться о 18:00. Хто і звідки сьогодні завітав до нас? Ким ви працюєте?"
            },
            {
                "title": "🗨 Шановні учасники вебінару, ви можете писати свої запитання/коментарі до загального чату..."
            },
            {
                "title": "📑 Заповніть, будь ласка, анкету лектора, запропонувавши тему: https://goo.gl/forms/y6i1WLcf7ygOLEcO2"
            },
            {
                "title": "📣 Отримуйте сповіщення про нові статті та вебінари. Підписуйтесь на наш телеграм-канал за посиланням: https://t.me/naurok та додавайте чудові стікери: https://t.me/addstickers/naurokpack"
            },
            {
                "title": "🔔 Щоб бути в курсі актуальних подій розділу «Підвищення кваліфікації» підписуйтеся на «Мій На Урок» у Телеграмі! Авторизуйтеся на сайті й перейдіть за посиланням: https://t.me/naurok_teacher_bot"
            },
            {
                "title": "⏰ Дізнайтесь першими про всі новини проєкту #наурок: підписуйтесь на нашу фейсбук-сторінку: https://www.facebook.com/naurok.com.ua"
            },
            {
                "title": ":yt: Не пропустіть нові відео! Підписуйтесь на наш YouTube-канал за посиланням: https://www.youtube.com/@NaurokComUa"
            },
            {
                "title": "🧩 Тести: https://naurok.com.ua/test/join"
            },
            {
                "title": "📢 Приєднуйтеся до нашої спільноти у Viber https://invite.viber.com/?g2=AQAa%2B9y2ntwa2Ui9%2Frsb2ifynb9JqV5JyDlUvYc3wCigUjAidgk4aZ%2B1hPRABdGp"
            },
            {
                "title": "📨 Напишіть нам у підтримку https://naurok.com.ua/page/contact-us свої дані: ПІБ, індекс відділення Укрпошти та номер телефону"
            },
            {
                "title": "❓ Ми збираємо всі запитання, лектор відповість наприкінці вебінару."
            },
            {
                "title": "📃 Добрий день. Зверніться, будь ласка, до служби підтримки: https://naurok.com.ua/page/contact-us"
            },
            {
                "title": "❗️ Колеги, рекомендуємо переглянути налаштування вашого профілю на сайті «На Урок», щоб зазначити актуальні дані, які будуть відображені на вашому свідоцтві: https://naurok.com.ua/preferences"
            },
            {
                "title": "⚙️ Шановні колеги, просимо вибачення за незручності. Відновимо трансляцію за декілька хвилин!"
            },
            {
                "title": ":yt: Не пропустіть нові відео та переглядайте записи усіх ефірів НаУрок на нашому ютуб-каналі: https://www.youtube.com/@NaurokComUa"
            },
            {
                "title": "✅ Реєструйтеся на вебінар пані ІМ'Я: ПОСИЛАННЯ."
            },
            {
                "title": "✅ Реєструйтеся на конференцію: ПОСИЛАННЯ."
            },
            {
                "title": "❗️ Шановні колеги, просимо вибачення за незручності. Ефір розпочнеться за 10-15 хвилин."
            },
            {
                "title": "▶️ Шановні колеги, якщо ефір не розпочався, оновіть сторінку та натисніть 'Play'."
            }
        ]
    },
    {
        "title": "Питання про ліцензію",
        "template": [
            {
                "title": "📑 Заповніть, будь ласка, анкету лектора, запропонувавши тему: https://goo.gl/forms/y6i1WLcf7ygOLEcO2"
            },
            {
                "title": "🔔 Свідоцтва від Освітнього проєкту «На Урок» відповідають вимогам чинного законодавства."
            },
            {
                "title": "📌 Освітній проект «На Урок» є суб'єктом підвищення кваліфікації відповідно до чинного законодавства..."
            },
            {
                "title": "❗️ Свідоцтва, видані нами, відповідають вимогам Положення №800 від 21.08.2019, https://naurok.com.ua/proof додаткова інформація тут."
            },
            {
                "title": "❗️ ​Інформація для адміністрацій! Заклади освіти можуть співпрацювати з ТОВ «На Урок» для організації процедури підвищення кваліфікації педагогічних працівників: https://naurok.com.ua/school/request"
            },
            {
                "title": "🔍Відповідно до вимог законодавства, підвищення кваліфікації вчителя відбувається постійно протягом 5 років (щонайменше 150 годин). Види, форми та суб'єкта підвищення він обирає сам."
            }
        ]
    },
    {
        "title": "Технічні моменти",
        "template": [
            {
                "title": "❗️ Якщо у Вас виникли проблеми з трансляцією, оновіть сторінку (кнопка F5)."
            },
            {
                "title": ":buffering: Якщо трансляція переривається та оновлення сторінки не допомагає, спробуйте очистити кеш браузера. Швидко зробити це можна за допомогою гарячих клавіш, зокрема: Ctrl+R."
            },
            {
                "title": "⚙️ Щоб покращити якість відеотрансляції, натисніть на шестерню в правому нижньому куті відео та виберіть більш якісний діапазон (720р)."
            },
            {
                "title": "❗️ Трансляція в нормі. Під'єднайте навушники/колонки. Перевірте з'єднання з інтернетом. Оновіть сторінку, якщо проблема не вирішується. Спробуйте зайти на вебінар через інший браузер"
            },
            {
                "title": "❗️ УВАГА! Шановні колеги, оберіть 720р у правому нижньому куті, там де шестерня, якщо нечітке зображення!"
            },
            {
                "title": ":buffering: Якщо у вас не йде відео, то оновіть сторінку та натисніть на трикутник, перевірте гучність на своєму пристрої та на ютубі."
            },
            {
                "title": "🔊 Якщо у вас слабкий звук, то додайте гучності на своєму пристрої та на ютубі (з лівого боку внизу у вікні)."
            },
            {
                "title": "❗️ Якщо трансляція все одно не відбувається, спробуйте зайти з іншого браузера (рекомендуємо Google Chrome)."
            },
            {
                "title": "⚙️ Щоб зображення стало кращим Вам потрібно зробити наступні дії: натиснути на шестерню та обрати 720р у правому нижньому куті."
            }
        ]
    }
]

const update = arr.map(obj => {
    const { title, template } = obj;
    obj.id = uuidv4();

    const updateTemplate = template.map(tpl => {
        const ds = uuidv4()
        return {
            {ds: {
                id: ds,
            ...tpl
            }}
        }
    })
    obj.template= [...updateTemplate]
    return obj
})

console.log(update)